import React from "react";
import { Text, View } from "react-native";

export default function DifferentBooks() {
  return (
    <View style={{ padding: 15, backgroundColor: "#E8F4F6" }}>
      <View
        style={{
          backgroundColor: "white",
          padding: 10,
          borderRadius: 5,
        }}
      >
        <Text
          style={{
            color: "blue",
            textAlign: "center",
            fontSize: 25,
            marginBottom: 10,
          }}
        >
          {" "}
          সুপ্রিম কোর্ট{" "}
        </Text>
      </View>

      <View
        style={{
          backgroundColor: "white",
          padding: 10,
          borderRadius: 5,
          marginTop: 10,
        }}
      >
        <Text>
          {" "}
          মঙ্গলবার দুপুরে সুপ্রিম কোর্ট আইনজীবী সমিতির সভাপতি ও সম্পাদকের কক্ষের
          সামনে অবস্থান নিয়ে পাল্টা স্লোগান দেন আওয়ামী লীগ সমর্থিত শতাধিক
          আইনজীবী। এই অবস্থায় মঙ্গলবার সুপ্রিম কোর্ট বারের সুষ্ঠু পরিবেশ বজায়
          রাখতে এবং সুষ্ঠু ও শান্তিপূর্ণ পরিবেশে সুপ্রিম কোর্ট বারের নির্বাচনের
          জন্য পদক্ষেপ নিতে প্রধান বিচারপতির সঙ্গে সাক্ষাৎ করেন সুপ্রিম কোর্ট
          বারের সাবেক সভাপতি ও সাবেক অ্যাটর্নি জেনারেল এ জে মেহাম্মদ আলী, সাবেক
          সম্পাদক মাহবুবউদ্দিন খোকন, রুহুল কুদ্দুস কাজল এবং কার্যকরী কমিটির
          (বিএনপি সমর্থিত) কোষাধ্যক্ষ মোহাম্মদ কামাল হোসেন, সিনিয়র সহ-সম্পাদক
          মাহফুজ বিন ইউসুফ ও সহ-সম্পাদক মোহাম্মদ মাহবুবুর রহমান খানসহ সাতজন।
          মঙ্গলবার দুপুরে সুপ্রিম কোর্ট আইনজীবী সমিতির সভাপতি ও সম্পাদকের কক্ষের
          সামনে অবস্থান নিয়ে পাল্টা স্লোগান দেন আওয়ামী লীগ সমর্থিত শতাধিক
          আইনজীবী। এই অবস্থায় মঙ্গলবার সুপ্রিম কোর্ট বারের সুষ্ঠু পরিবেশ বজায়
          রাখতে এবং সুষ্ঠু ও শান্তিপূর্ণ পরিবেশে সুপ্রিম কোর্ট বারের নির্বাচনের
          জন্য পদক্ষেপ নিতে প্রধান বিচারপতির সঙ্গে সাক্ষাৎ করেন সুপ্রিম কোর্ট
          বারের সাবেক সভাপতি ও সাবেক অ্যাটর্নি জেনারেল এ জে মেহাম্মদ আলী, সাবেক
          সম্পাদক মাহবুবউদ্দিন খোকন, রুহুল কুদ্দুস কাজল এবং কার্যকরী কমিটির
          (বিএনপি সমর্থিত) কোষাধ্যক্ষ মোহাম্মদ কামাল হোসেন, সিনিয়র সহ-সম্পাদক
          মাহফুজ বিন ইউসুফ ও সহ-সম্পাদক মোহাম্মদ মাহবুবুর রহমান খানসহ সাতজন।
        </Text>
      </View>
    </View>
  );
}
